# DelSavedSetting

## Description
Delete saved settings.

```pascal
FUNCTION DelSavedSetting(
				category : STRING;
				setting  : STRING): BOOLEAN;
```

```python
def vs.DelSavedSetting(category, setting):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|category|STRING|The category for the setting.|
|setting|STRING|The setting to be deleted.|

## See Also
VS Functions:
DelSavedSettings
| SetSavedSetting
| GetSavedSetting

## Version
Availability: from Vectorworks 2014

## Category
* Utility